# Задание № 2, Кривоногов Н.В.

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('../datasets/kaggle_survey_2022_responses.csv')

C:\Users\Николай\AppData\Local\Temp\ipykernel_6568\717743107.py:1: DtypeWarning: Columns (0,208,225,255,257,260,270,271,277) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('../datasets/kaggle_survey_2022_responses.csv')

In [3]:
name2question = data.iloc[0]

name2question

Duration (in seconds)                                Duration (in seconds)
Q2                                             What is your age (# years)?
Q3                                  What is your gender? - Selected Choice
Q4                               In which country do you currently reside?
Q5                       Are you currently a student? (high school, uni...
                                               ...
Q44_8                    Who/what are your favorite media sources that ...
Q44_9                    Who/what are your favorite media sources that ...
Q44_10                   Who/what are your favorite media sources that ...
Q44_11                   Who/what are your favorite media sources that ...
Q44_12                   Who/what are your favorite media sources that ...
Name: 0, Length: 296, dtype: object

In [9]:
name2question[25:35]

Q9       Have you ever published any academic research ...
Q10_1    Did your research make use of machine learning...
Q10_2    Did your research make use of machine learning...
Q10_3    Did your research make use of machine learning...
Q11      For how many years have you been writing code ...
Q12_1    What programming languages do you use on a reg...
Q12_2    What programming languages do you use on a reg...
Q12_3    What programming languages do you use on a reg...
Q12_4    What programming languages do you use on a reg...
Q12_5    What programming languages do you use on a reg...
Name: 0, dtype: object

In [5]:
df = data[data['Q23'] == 'Data Scientist']

In [10]:
df = df[['Q2', 'Q11']]

In [11]:
df

          Q2          Q11
4      55-59  10-20 years
17     40-44  10-20 years
18     30-34   5-10 years
30     35-39   5-10 years
36     25-29    3-5 years
...      ...          ...
23930  25-29    < 1 years
23932  25-29  10-20 years
23935  25-29   5-10 years
23964  30-34    3-5 years
23990  35-39    1-3 years

[1929 rows x 2 columns]

In [4]:
data.drop(0, inplace=True)

data.head()

,Duration (in seconds),Q2,Q3,Q4,Q5,Q6_1,Q6_2,Q6_3,Q6_4,Q6_5,...,Q44_3,Q44_4,Q44_5,Q44_6,Q44_7,Q44_8,Q44_9,Q44_10,Q44_11,Q44_12
1,121,30-34,Man,India,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,462,30-34,Man,Algeria,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,293,18-21,Man,Egypt,Yes,Coursera,edX,NaN,DataCamp,NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,"YouTube (Kaggle YouTube, Cloud AI Adventures, ...","Podcasts (Chai Time Data Science, O’Reilly Dat...",NaN,NaN,NaN,NaN,NaN
4,851,55-59,Man,France,No,Coursera,NaN,Kaggle Learn Courses,NaN,NaN,...,NaN,"Kaggle (notebooks, forums, etc)","Course Forums (forums.fast.ai, Coursera forums...",NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
5,232,45-49,Man,India,Yes,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN

## Task 1

Узнай самый часто встречаемый возраст респондентов

In [5]:
# Код тут

print(f"Самый часто встречаемый возраст респондентов: {data['Q2'].value_counts().head(1).index[0]} год.")

Самый часто встречаемый возраст респондентов: 18-21 год.

## Task 2

Посчитай долю женщин среди русских участников опроса, которые уже не студенты. Результат округли до двух цифр после запятой

In [6]:
# Код тут

data_task2 = data[(data['Q4'] == 'Russia') & (data['Q5'] == 'No')]

print(f"Доля женщин среди русских участников опроса, которые уже не студенты: {round(data_task2['Q3'].value_counts(normalize=True).values[1], 2)}.")

Доля женщин среди русских участников опроса, которые уже не студенты: 0.24.

## Task 3

Найди среднее время заполнения опроса в **минутах**. Результат округли до двух знаков после запятой

In [7]:
# Код тут

print(f"Среднее время заполнения опроса в минутах: {round(data['Duration (in seconds)'].astype(int).mean() / 60, 2)}.")

Среднее время заполнения опроса в минутах: 168.17.

## Task 4

Выведи топ-3 образовательных курса, которые указали респонденты. P.S Это вопрос Q6

In [8]:
# Код тут

# формирую словарь колонок, которые начинаются на Q6:

q6_columns = [col for col in data.columns if col.startswith('Q6')]

q6_columns

['Q6_1',
 'Q6_2',
 'Q6_3',
 'Q6_4',
 'Q6_5',
 'Q6_6',
 'Q6_7',
 'Q6_8',
 'Q6_9',
 'Q6_10',
 'Q6_11',
 'Q6_12']

In [9]:
# объединяю все колонки в одну:

courses = data[q6_columns].melt(var_name='questions', value_vars=q6_columns)

courses

       questions     value
0           Q6_1       NaN
1           Q6_1       NaN
2           Q6_1  Coursera
3           Q6_1  Coursera
4           Q6_1       NaN
...          ...       ...
287959     Q6_12       NaN
287960     Q6_12       NaN
287961     Q6_12       NaN
287962     Q6_12       NaN
287963     Q6_12     Other

[287964 rows x 2 columns]

In [10]:
# топ-3 образовательных курса:

courses_top3 = courses['value'].value_counts().head(3).index

courses_top3

Index(['Coursera', 'University Courses (resulting in a university degree)',
       'Kaggle Learn Courses'],
      dtype='object')

In [11]:
# ответ: 

print(f"Топ-3 образовательных курса, которые указали респонденты: \n{courses_top3[0], courses_top3[1], courses_top3[2]}")

Топ-3 образовательных курса, которые указали респонденты:
('Coursera', 'University Courses (resulting in a university degree)', 'Kaggle Learn Courses')

## Task 5

Узнай топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе

In [12]:
# Код тут

# создаю датафрейм, где осталась только профессия Data Scientist:

data_task5 = data[data['Q23'] == 'Data Scientist']

data_task5.head()

,Duration (in seconds),Q2,Q3,Q4,Q5,Q6_1,Q6_2,Q6_3,Q6_4,Q6_5,...,Q44_3,Q44_4,Q44_5,Q44_6,Q44_7,Q44_8,Q44_9,Q44_10,Q44_11,Q44_12
4,851,55-59,Man,France,No,Coursera,NaN,Kaggle Learn Courses,NaN,NaN,...,NaN,"Kaggle (notebooks, forums, etc)","Course Forums (forums.fast.ai, Coursera forums...",NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
17,679,40-44,Man,United States of America,No,Coursera,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,"Podcasts (Chai Time Data Science, O’Reilly Dat...","Blogs (Towards Data Science, Analytics Vidhya,...","Journal Publications (peer-reviewed journals, ...",NaN,NaN,NaN
18,10619,30-34,Man,United States of America,No,Coursera,NaN,Kaggle Learn Courses,NaN,NaN,...,"Reddit (r/machinelearning, etc)","Kaggle (notebooks, forums, etc)",NaN,"YouTube (Kaggle YouTube, Cloud AI Adventures, ...",NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
30,1481,35-39,Man,Chile,No,NaN,NaN,NaN,DataCamp,NaN,...,NaN,"Kaggle (notebooks, forums, etc)","Course Forums (forums.fast.ai, Coursera forums...",NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
36,506,25-29,Man,Japan,No,NaN,NaN,NaN,NaN,NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
# формирую словарь колонок, которые начинаются на Q12:

q12_columns = [col for col in data_task5.columns if col.startswith('Q12')]

q12_columns

['Q12_1',
 'Q12_2',
 'Q12_3',
 'Q12_4',
 'Q12_5',
 'Q12_6',
 'Q12_7',
 'Q12_8',
 'Q12_9',
 'Q12_10',
 'Q12_11',
 'Q12_12',
 'Q12_13',
 'Q12_14',
 'Q12_15']

In [14]:
# объединяю все колонки в одну:

languages = data_task5[q12_columns].melt(var_name='questions', value_vars=q12_columns)

languages

      questions   value
0         Q12_1  Python
1         Q12_1  Python
2         Q12_1  Python
3         Q12_1  Python
4         Q12_1  Python
...         ...     ...
28930    Q12_15     NaN
28931    Q12_15     NaN
28932    Q12_15     NaN
28933    Q12_15     NaN
28934    Q12_15     NaN

[28935 rows x 2 columns]

In [15]:
# топ-5 языков программирования:

languages_top5 = languages['value'].value_counts().head(5).index

languages_top5

Index(['Python', 'SQL', 'R', 'Bash', 'Javascript'], dtype='object')

In [16]:
# ответ: 

print(f"Топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе: \n{languages_top5[0], languages_top5[1], languages_top5[2], languages_top5[3], languages_top5[4]}")

Топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе:
('Python', 'SQL', 'R', 'Bash', 'Javascript')

## Task 6

Узнай средний доход среди 'Data Scientist' специалистов и средний доход среди 'Machine Learning/ MLops Engineer' \
Т.к. в колонке Q29 указан промежуток, то возьми среднее значение из промежутка. 

Например: 
- '15,000-19,999' - 17500, 
- '125,000-149,999' - 137500. 
- \> $1,000,000 - оставляем 1000000

Средние доход **округли до целого.**

In [17]:
# смотрю содержание вопроса Q23:

name2question['Q23']

'Select the title most similar to your current role (or most recent title if retired): - Selected Choice'

In [18]:
# смотрю значения и их количество в признаке Q23: 

data['Q23'].value_counts()

Data Scientist                                                      1929
Data Analyst (Business, Marketing, Financial, Quantitative, etc)    1538
Currently not employed                                              1432
Software Engineer                                                    980
Teacher / professor                                                  833
Manager (Program, Project, Operations, Executive-level, etc)         832
Other                                                                754
Research Scientist                                                   593
Machine Learning/ MLops Engineer                                     571
Engineer (non-software)                                              465
Data Engineer                                                        352
Statistician                                                         125
Data Architect                                                        95
Data Administrator                                                    70
Developer Advocate                                                    61
Name: Q23, dtype: int64

In [19]:
# смотрю содержание вопроса Q29:

name2question['Q29']

'What is your current yearly compensation (approximate $USD)?'

In [20]:
# смотрю значения и их количество в признаке Q29: 

data['Q29'].value_counts()

$0-999              1112
10,000-14,999        493
30,000-39,999        464
1,000-1,999          444
40,000-49,999        421
100,000-124,999      404
5,000-7,499          391
50,000-59,999        366
7,500-9,999          362
150,000-199,999      342
20,000-24,999        337
60,000-69,999        318
15,000-19,999        299
70,000-79,999        289
25,000-29,999        277
2,000-2,999          271
125,000-149,999      269
3,000-3,999          244
4,000-4,999          234
80,000-89,999        222
90,000-99,999        197
200,000-249,999      155
250,000-299,999       78
300,000-499,999       76
$500,000-999,999      48
>$1,000,000           23
Name: Q29, dtype: int64

In [21]:
# создаю словарь, переводя промежутки в среднее:

compensation_mapping = {
    '$0-999': 500,
    '40,000-49,999': 45000,
    '150,000-199,999': 175000,
    '100,000-124,999': 112500,
    '10,000-14,999': 12500,
    '30,000-39,999': 35000,
    '50,000-59,999': 55000,
    '1,000-1,999': 1500,
    '125,000-149,999': 137500,
    '60,000-69,999': 65000,
    '20,000-24,999': 22500,
    '25,000-29,999': 27500,
    '200,000-249,999': 225000,
    '70,000-79,999': 75000,
    '80,000-89,999': 85000,
    '5,000-7,499': 6250,
    '15,000-19,999': 17500,
    '7,500-9,999': 8750,
    '4,000-4,999': 4500,
    '2,000-2,999': 2500,
    '90,000-99,999': 95000,
    '3,000-3,999': 3500,
    '250,000-299,999': 275000,
    '300,000-499,999': 400000,
    '>$1,000,000': 1000000,
    '$500,000-999,999': 750000
}

In [22]:
# создаю новый признак Q29_NEW, применяя вышеуказанную замену: 

data['Q29_NEW'] = data['Q29'].map(compensation_mapping)

In [23]:
# смотрю значения и их количество в признаке Q29_NEW: 

data['Q29_NEW'].value_counts()

500.0        1112
12500.0       493
35000.0       464
1500.0        444
45000.0       421
112500.0      404
6250.0        391
55000.0       366
8750.0        362
175000.0      342
22500.0       337
65000.0       318
17500.0       299
75000.0       289
27500.0       277
2500.0        271
137500.0      269
3500.0        244
4500.0        234
85000.0       222
95000.0       197
225000.0      155
275000.0       78
400000.0       76
750000.0       48
1000000.0      23
Name: Q29_NEW, dtype: int64

In [24]:
# создаю датафрейм из признаков Q23 и Q29_NEW и удаляю пропуски значений в нем: 

compensation = data[['Q23', 'Q29_NEW']].dropna()

compensation

                           Q23   Q29_NEW
4               Data Scientist   27500.0
8            Software Engineer  112500.0
9           Research Scientist  112500.0
14          Developer Advocate  225000.0
17              Data Scientist  225000.0
...                        ...       ...
23985           Data Architect  112500.0
23990           Data Scientist    2500.0
23991            Data Engineer     500.0
23995  Engineer (non-software)   27500.0
23996       Research Scientist   17500.0

[8136 rows x 2 columns]

In [25]:
# создаю итоговый датафрейм при помощи группировки: 

role_compensation = compensation.groupby('Q23')['Q29_NEW'].mean()

role_compensation

Q23
Data Administrator                                                   23559.701493
Data Analyst (Business, Marketing, Financial, Quantitative, etc)     33407.058389
Data Architect                                                       92658.536585
Data Engineer                                                        48551.393728
Data Scientist                                                       70337.236534
Developer Advocate                                                   71032.407407
Engineer (non-software)                                              33358.353511
Machine Learning/ MLops Engineer                                     67437.747036
Manager (Program, Project, Operations, Executive-level, etc)        100944.369973
Other                                                                49662.023460
Research Scientist                                                   71432.380952
Software Engineer                                                    51028.230501
Statistician                                                         34706.018519
Teacher / professor                                                  33284.182306
Name: Q29_NEW, dtype: float64

In [26]:
# ответ: 

print(f"Средние доходы среди специалистов 'Data Scientist': {round(role_compensation['Data Scientist'], 0)} $USD и 'Machine Learning/ MLops Engineer': {round(role_compensation['Machine Learning/ MLops Engineer'], 0)} $USD.")

Средние доходы среди специалистов 'Data Scientist': 70337.0 $USD и 'Machine Learning/ MLops Engineer': 67438.0 $USD.

## Дополнительно

Найди какой-нибудь интересный инсайт из этих данных. Пиши свои интересные инсайты в чат проекта с хэштегом.
#инсайт

Автор самого интересного инсайта получит p2p баллы. Поверь, они тебе понадобятся

In [27]:
# Код тут

print(f'Всего опрошенных респондентов: {data.shape[0]} человек.')

Всего опрошенных респондентов: 23997 человек.

In [28]:
data_insight = data[(data['Q2'] == '35-39') & (data['Q3'] == 'Man') & (data['Q4'] == 'Russia')]

print(f"Русских респондентов мужского пола в возрасте 35-39 лет: {data_insight.shape[0]} человека.")

Русских респондентов мужского пола в возрасте 35-39 лет: 24 человека.

Инсайт должен быть прикладным прежде всего. :) 

8 августа 2023 года мне будет 39 лет. Я русский мужчина.

In [29]:
print(f"И значит, вероятность того, что я стану дата саентистом приблизительно равна {round(data_insight.shape[0] / data.shape[0] * 100, 2)} %...")

И значит, вероятность того, что я стану дата саентистом приблизительно равна 0.1 %...

## Task 6

Узнай средний доход среди 'Data Scientist' специалистов и средний доход среди 'Machine Learning/ MLops Engineer' \
Т.к. в колонке Q29 указан промежуток, то возьми среднее значение из промежутка. 

Например: 
- '15,000-19,999' - 17500, 
- '125,000-149,999' - 137500. 
- \> $1,000,000 - оставляем 1000000

Средние доход **округли до целого.**

In [30]:
data['Q29'].value_counts()

$0-999              1112
10,000-14,999        493
30,000-39,999        464
1,000-1,999          444
40,000-49,999        421
100,000-124,999      404
5,000-7,499          391
50,000-59,999        366
7,500-9,999          362
150,000-199,999      342
20,000-24,999        337
60,000-69,999        318
15,000-19,999        299
70,000-79,999        289
25,000-29,999        277
2,000-2,999          271
125,000-149,999      269
3,000-3,999          244
4,000-4,999          234
80,000-89,999        222
90,000-99,999        197
200,000-249,999      155
250,000-299,999       78
300,000-499,999       76
$500,000-999,999      48
>$1,000,000           23
Name: Q29, dtype: int64

In [35]:
data['Q29']

1                  NaN
2                  NaN
3                  NaN
4        25,000-29,999
5                  NaN
             ...
23993              NaN
23994              NaN
23995    25,000-29,999
23996    15,000-19,999
23997              NaN
Name: Q29, Length: 23997, dtype: object

In [34]:
data['Q29'].apply(type)

1        <class 'float'>
2        <class 'float'>
3        <class 'float'>
4          <class 'str'>
5        <class 'float'>
              ...
23993    <class 'float'>
23994    <class 'float'>
23995      <class 'str'>
23996      <class 'str'>
23997    <class 'float'>
Name: Q29, Length: 23997, dtype: object

In [33]:
data.dtypes

Duration (in seconds)     object
Q2                        object
Q3                        object
Q4                        object
Q5                        object
                          ...
Q44_9                     object
Q44_10                    object
Q44_11                    object
Q44_12                    object
Q29_NEW                  float64
Length: 297, dtype: object